GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.h
extern volatile INT3PPSbits_t INT3PPSbits __at(0xDF3);
// bitfield macros
#define _INT3PPS_PIN_POSN                                   0x0
#define _INT3PPS_PIN_POSITION                               0x0
#define _INT3PPS_PIN_SIZE                                   0x3
#define _INT3PPS_PIN_LENGTH                                 0x3
#define _INT3PPS_PIN_MASK                                   0x7
#define _INT3PPS_PORT_POSN                                  0x3
#define _INT3PPS_PORT_POSITION                              0x3
#define _INT3PPS_PORT_SIZE                                  0x3
#define _INT3PPS_PORT_LENGTH                                0x3
#define _INT3PPS_PORT_MASK                                  0x38
#define _INT3PPS_INT3PPS_POSN                               0x0
#define _INT3PPS_INT3PPS_POSITION                           0x0
#define _INT3PPS_INT3PPS_SIZE                               0x6
#define _INT3PPS_INT3PPS_LENGTH                             0x6
#define _INT3PPS_INT3PPS_MASK                               0x3F
#define _INT3PPS_INT3PPS0_POSN                              0x0
#define _INT3PPS_INT3PPS0_POSITION                          0x0
#define _INT3PPS_INT3PPS0_SIZE                              0x1
#define _INT3PPS_INT3PPS0_LENGTH                            0x1
#define _INT3PPS_INT3PPS0_MASK                              0x1
#define _INT3PPS_INT3PPS1_POSN                              0x1
#define _INT3PPS_INT3PPS1_POSITION                          0x1
#define _INT3PPS_INT3PPS1_SIZE                              0x1
#define _INT3PPS_INT3PPS1_LENGTH                            0x1
#define _INT3PPS_INT3PPS1_MASK                              0x2
#define _INT3PPS_INT3PPS2_POSN                              0x2
#define _INT3PPS_INT3PPS2_POSITION                          0x2
#define _INT3PPS_INT3PPS2_SIZE                              0x1
#define _INT3PPS_INT3PPS2_LENGTH                            0x1
#define _INT3PPS_INT3PPS2_MASK                              0x4
#define _INT3PPS_INT3PPS3_POSN                              0x3
#define _INT3PPS_INT3PPS3_POSITION                          0x3
#define _INT3PPS_INT3PPS3_SIZE                              0x1
#define _INT3PPS_INT3PPS3_LENGTH                            0x1
#define _INT3PPS_INT3PPS3_MASK                              0x8
#define _INT3PPS_INT3PPS4_POSN                              0x4
#define _INT3PPS_INT3PPS4_POSITION                          0x4
#define _INT3PPS_INT3PPS4_SIZE                              0x1
#define _INT3PPS_INT3PPS4_LENGTH                            0x1
#define _INT3PPS_INT3PPS4_MASK                              0x10
#define _INT3PPS_INT3PPS5_POSN                              0x5
#define _INT3PPS_INT3PPS5_POSITION                          0x5
#define _INT3PPS_INT3PPS5_SIZE                              0x1
#define _INT3PPS_INT3PPS5_LENGTH                            0x1
#define _INT3PPS_INT3PPS5_MASK                              0x20

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0xDF4);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 0DF4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :1;
    };
    struct {
        unsigned T0CKIPPS               :6;
    };
    struct {
        unsigned T0CKIPPS0              :1;
        unsigned T0CKIPPS1              :1;
        unsigned T0CKIPPS2              :1;
        unsigned T0CKIPPS3              :1;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits __at(0xDF4);
// bitfield macros
#define _T0CKIPPS_PIN_POSN                                  0x0
#define _T0CKIPPS_PIN_POSITION                              0x0
#define _T0CKIPPS_PIN_SIZE                                  0x3
#define _T0CKIPPS_PIN_LENGTH                                0x3
#define _T0CKIPPS_PIN_MASK                                  0x7
#define _T0CKIPPS_PORT_POSN                                 0x3
#define _T0CKIPPS_PORT_POSITION                             0x3
#define _T0CKIPPS_PORT_SIZE                                 0x1
#define _T0CKIPPS_PORT_LENGTH                               0x1
#define _T0CKIPPS_PORT_MASK                                 0x8
#define _T0CKIPPS_T0CKIPPS_POSN                             0x0
#define _T0CKIPPS_T0CKIPPS_POSITION                         0x0
#define _T0CKIPPS_T0CKIPPS_SIZE                             0x6
#define _T0CKIPPS_T0CKIPPS_LENGTH                           0x6
#define _T0CKIPPS_T0CKIPPS_MASK                             0x3F
#define _T0CKIPPS_T0CKIPPS0_POSN                            0x0
#define _T0CKIPPS_T0CKIPPS0_POSITION                        0x0
#define _T0CKIPPS_T0CKIPPS0_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS0_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS0_MASK                            0x1
#define _T0CKIPPS_T0CKIPPS1_POSN                            0x1
#define _T0CKIPPS_T0CKIPPS1_POSITION                        0x1
#define _T0CKIPPS_T0CKIPPS1_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS1_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS1_MASK                            0x2
#define _T0CKIPPS_T0CKIPPS2_POSN                            0x2
#define _T0CKIPPS_T0CKIPPS2_POSITION                        0x2
#define _T0CKIPPS_T0CKIPPS2_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS2_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS2_MASK                            0x4
#define _T0CKIPPS_T0CKIPPS3_POSN                            0x3
#define _T0CKIPPS_T0CKIPPS3_POSITION                        0x3
#define _T0CKIPPS_T0CKIPPS3_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS3_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS3_MASK                            0x8

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            __at(0xDF5);
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 0DF5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned T1CKIPPS               :6;
    };
    struct {
        unsigned T1CKIPPS0              :1;
        unsigned T1CKIPPS1              :1;
        unsigned T1CKIPPS2              :1;
        unsigned T1CKIPPS3              :1;
        unsigned T1CKIPPS4              :1;
    };
} T1CKIPPSbits_t;
