GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.h
extern volatile T6INPPSbits_t T6INPPSbits __at(0xDFF);
// bitfield macros
#define _T6INPPS_PIN_POSN                                   0x0
#define _T6INPPS_PIN_POSITION                               0x0
#define _T6INPPS_PIN_SIZE                                   0x3
#define _T6INPPS_PIN_LENGTH                                 0x3
#define _T6INPPS_PIN_MASK                                   0x7
#define _T6INPPS_PORT_POSN                                  0x3
#define _T6INPPS_PORT_POSITION                              0x3
#define _T6INPPS_PORT_SIZE                                  0x2
#define _T6INPPS_PORT_LENGTH                                0x2
#define _T6INPPS_PORT_MASK                                  0x18
#define _T6INPPS_T6INPPS_POSN                               0x0
#define _T6INPPS_T6INPPS_POSITION                           0x0
#define _T6INPPS_T6INPPS_SIZE                               0x6
#define _T6INPPS_T6INPPS_LENGTH                             0x6
#define _T6INPPS_T6INPPS_MASK                               0x3F
#define _T6INPPS_T6INPPS0_POSN                              0x0
#define _T6INPPS_T6INPPS0_POSITION                          0x0
#define _T6INPPS_T6INPPS0_SIZE                              0x1
#define _T6INPPS_T6INPPS0_LENGTH                            0x1
#define _T6INPPS_T6INPPS0_MASK                              0x1
#define _T6INPPS_T6INPPS1_POSN                              0x1
#define _T6INPPS_T6INPPS1_POSITION                          0x1
#define _T6INPPS_T6INPPS1_SIZE                              0x1
#define _T6INPPS_T6INPPS1_LENGTH                            0x1
#define _T6INPPS_T6INPPS1_MASK                              0x2
#define _T6INPPS_T6INPPS2_POSN                              0x2
#define _T6INPPS_T6INPPS2_POSITION                          0x2
#define _T6INPPS_T6INPPS2_SIZE                              0x1
#define _T6INPPS_T6INPPS2_LENGTH                            0x1
#define _T6INPPS_T6INPPS2_MASK                              0x4
#define _T6INPPS_T6INPPS3_POSN                              0x3
#define _T6INPPS_T6INPPS3_POSITION                          0x3
#define _T6INPPS_T6INPPS3_SIZE                              0x1
#define _T6INPPS_T6INPPS3_LENGTH                            0x1
#define _T6INPPS_T6INPPS3_MASK                              0x8
#define _T6INPPS_T6INPPS4_POSN                              0x4
#define _T6INPPS_T6INPPS4_POSITION                          0x4
#define _T6INPPS_T6INPPS4_SIZE                              0x1
#define _T6INPPS_T6INPPS4_LENGTH                            0x1
#define _T6INPPS_T6INPPS4_MASK                              0x10

// Register: T8INPPS
#define T8INPPS T8INPPS
extern volatile unsigned char           T8INPPS             __at(0xE00);
#ifndef _LIB_BUILD
asm("T8INPPS equ 0E00h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned T8INPPS                :6;
    };
    struct {
        unsigned T8INPPS0               :1;
        unsigned T8INPPS1               :1;
        unsigned T8INPPS2               :1;
        unsigned T8INPPS3               :1;
        unsigned T8INPPS4               :1;
        unsigned T8INPPS5               :1;
    };
} T8INPPSbits_t;
extern volatile T8INPPSbits_t T8INPPSbits __at(0xE00);
// bitfield macros
#define _T8INPPS_PIN_POSN                                   0x0
#define _T8INPPS_PIN_POSITION                               0x0
#define _T8INPPS_PIN_SIZE                                   0x3
#define _T8INPPS_PIN_LENGTH                                 0x3
#define _T8INPPS_PIN_MASK                                   0x7
#define _T8INPPS_PORT_POSN                                  0x3
#define _T8INPPS_PORT_POSITION                              0x3
#define _T8INPPS_PORT_SIZE                                  0x3
#define _T8INPPS_PORT_LENGTH                                0x3
#define _T8INPPS_PORT_MASK                                  0x38
#define _T8INPPS_T8INPPS_POSN                               0x0
#define _T8INPPS_T8INPPS_POSITION                           0x0
#define _T8INPPS_T8INPPS_SIZE                               0x6
#define _T8INPPS_T8INPPS_LENGTH                             0x6
#define _T8INPPS_T8INPPS_MASK                               0x3F
#define _T8INPPS_T8INPPS0_POSN                              0x0
#define _T8INPPS_T8INPPS0_POSITION                          0x0
#define _T8INPPS_T8INPPS0_SIZE                              0x1
#define _T8INPPS_T8INPPS0_LENGTH                            0x1
#define _T8INPPS_T8INPPS0_MASK                              0x1
#define _T8INPPS_T8INPPS1_POSN                              0x1
#define _T8INPPS_T8INPPS1_POSITION                          0x1
#define _T8INPPS_T8INPPS1_SIZE                              0x1
#define _T8INPPS_T8INPPS1_LENGTH                            0x1
#define _T8INPPS_T8INPPS1_MASK                              0x2
#define _T8INPPS_T8INPPS2_POSN                              0x2
#define _T8INPPS_T8INPPS2_POSITION                          0x2
#define _T8INPPS_T8INPPS2_SIZE                              0x1
#define _T8INPPS_T8INPPS2_LENGTH                            0x1
#define _T8INPPS_T8INPPS2_MASK                              0x4
#define _T8INPPS_T8INPPS3_POSN                              0x3
#define _T8INPPS_T8INPPS3_POSITION                          0x3
#define _T8INPPS_T8INPPS3_SIZE                              0x1
#define _T8INPPS_T8INPPS3_LENGTH                            0x1
#define _T8INPPS_T8INPPS3_MASK                              0x8
#define _T8INPPS_T8INPPS4_POSN                              0x4
#define _T8INPPS_T8INPPS4_POSITION                          0x4
#define _T8INPPS_T8INPPS4_SIZE                              0x1
#define _T8INPPS_T8INPPS4_LENGTH                            0x1
#define _T8INPPS_T8INPPS4_MASK                              0x10
#define _T8INPPS_T8INPPS5_POSN                              0x5
#define _T8INPPS_T8INPPS5_POSITION                          0x5
#define _T8INPPS_T8INPPS5_SIZE                              0x1
#define _T8INPPS_T8INPPS5_LENGTH                            0x1
#define _T8INPPS_T8INPPS5_MASK                              0x20

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
extern volatile unsigned char           ADACTPPS            __at(0xE01);
#ifndef _LIB_BUILD
asm("ADACTPPS equ 0E01h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned ADACTPPS               :6;
    };
    struct {
        unsigned ADACTPPS0              :1;
        unsigned ADACTPPS1              :1;
        unsigned ADACTPPS2              :1;
        unsigned ADACTPPS3              :1;
        unsigned ADACTPPS4              :1;
        unsigned ADACTPPS5              :1;
    };
} ADACTPPSbits_t;
