GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.h
extern volatile ANSELDbits_t ANSELDbits __at(0xEA7);
// bitfield macros
#define _ANSELD_ANSELD0_POSN                                0x0
#define _ANSELD_ANSELD0_POSITION                            0x0
#define _ANSELD_ANSELD0_SIZE                                0x1
#define _ANSELD_ANSELD0_LENGTH                              0x1
#define _ANSELD_ANSELD0_MASK                                0x1
#define _ANSELD_ANSELD1_POSN                                0x1
#define _ANSELD_ANSELD1_POSITION                            0x1
#define _ANSELD_ANSELD1_SIZE                                0x1
#define _ANSELD_ANSELD1_LENGTH                              0x1
#define _ANSELD_ANSELD1_MASK                                0x2
#define _ANSELD_ANSELD2_POSN                                0x2
#define _ANSELD_ANSELD2_POSITION                            0x2
#define _ANSELD_ANSELD2_SIZE                                0x1
#define _ANSELD_ANSELD2_LENGTH                              0x1
#define _ANSELD_ANSELD2_MASK                                0x4
#define _ANSELD_ANSELD3_POSN                                0x3
#define _ANSELD_ANSELD3_POSITION                            0x3
#define _ANSELD_ANSELD3_SIZE                                0x1
#define _ANSELD_ANSELD3_LENGTH                              0x1
#define _ANSELD_ANSELD3_MASK                                0x8
#define _ANSELD_ANSELD4_POSN                                0x4
#define _ANSELD_ANSELD4_POSITION                            0x4
#define _ANSELD_ANSELD4_SIZE                                0x1
#define _ANSELD_ANSELD4_LENGTH                              0x1
#define _ANSELD_ANSELD4_MASK                                0x10
#define _ANSELD_ANSELD5_POSN                                0x5
#define _ANSELD_ANSELD5_POSITION                            0x5
#define _ANSELD_ANSELD5_SIZE                                0x1
#define _ANSELD_ANSELD5_LENGTH                              0x1
#define _ANSELD_ANSELD5_MASK                                0x20
#define _ANSELD_ANSELD6_POSN                                0x6
#define _ANSELD_ANSELD6_POSITION                            0x6
#define _ANSELD_ANSELD6_SIZE                                0x1
#define _ANSELD_ANSELD6_LENGTH                              0x1
#define _ANSELD_ANSELD6_MASK                                0x40
#define _ANSELD_ANSELD7_POSN                                0x7
#define _ANSELD_ANSELD7_POSITION                            0x7
#define _ANSELD_ANSELD7_SIZE                                0x1
#define _ANSELD_ANSELD7_LENGTH                              0x1
#define _ANSELD_ANSELD7_MASK                                0x80

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0xEA8);
#ifndef _LIB_BUILD
asm("IOCEF equ 0EA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCEF0                 :1;
        unsigned IOCEF1                 :1;
        unsigned IOCEF2                 :1;
        unsigned IOCEF3                 :1;
        unsigned IOCEF4                 :1;
        unsigned IOCEF5                 :1;
        unsigned IOCEF6                 :1;
        unsigned IOCEF7                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0xEA8);
// bitfield macros
#define _IOCEF_IOCEF0_POSN                                  0x0
#define _IOCEF_IOCEF0_POSITION                              0x0
#define _IOCEF_IOCEF0_SIZE                                  0x1
#define _IOCEF_IOCEF0_LENGTH                                0x1
#define _IOCEF_IOCEF0_MASK                                  0x1
#define _IOCEF_IOCEF1_POSN                                  0x1
#define _IOCEF_IOCEF1_POSITION                              0x1
#define _IOCEF_IOCEF1_SIZE                                  0x1
#define _IOCEF_IOCEF1_LENGTH                                0x1
#define _IOCEF_IOCEF1_MASK                                  0x2
#define _IOCEF_IOCEF2_POSN                                  0x2
#define _IOCEF_IOCEF2_POSITION                              0x2
#define _IOCEF_IOCEF2_SIZE                                  0x1
#define _IOCEF_IOCEF2_LENGTH                                0x1
#define _IOCEF_IOCEF2_MASK                                  0x4
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8
#define _IOCEF_IOCEF4_POSN                                  0x4
#define _IOCEF_IOCEF4_POSITION                              0x4
#define _IOCEF_IOCEF4_SIZE                                  0x1
#define _IOCEF_IOCEF4_LENGTH                                0x1
#define _IOCEF_IOCEF4_MASK                                  0x10
#define _IOCEF_IOCEF5_POSN                                  0x5
#define _IOCEF_IOCEF5_POSITION                              0x5
#define _IOCEF_IOCEF5_SIZE                                  0x1
#define _IOCEF_IOCEF5_LENGTH                                0x1
#define _IOCEF_IOCEF5_MASK                                  0x20
#define _IOCEF_IOCEF6_POSN                                  0x6
#define _IOCEF_IOCEF6_POSITION                              0x6
#define _IOCEF_IOCEF6_SIZE                                  0x1
#define _IOCEF_IOCEF6_LENGTH                                0x1
#define _IOCEF_IOCEF6_MASK                                  0x40
#define _IOCEF_IOCEF7_POSN                                  0x7
#define _IOCEF_IOCEF7_POSITION                              0x7
#define _IOCEF_IOCEF7_SIZE                                  0x1
#define _IOCEF_IOCEF7_LENGTH                                0x1
#define _IOCEF_IOCEF7_MASK                                  0x80

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0xEA9);
#ifndef _LIB_BUILD
asm("IOCEN equ 0EA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCEN0                 :1;
        unsigned IOCEN1                 :1;
        unsigned IOCEN2                 :1;
        unsigned IOCEN3                 :1;
        unsigned IOCEN4                 :1;
        unsigned IOCEN5                 :1;
        unsigned IOCEN6                 :1;
        unsigned IOCEN7                 :1;
    };
} IOCENbits_t;
