GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.h
extern volatile CM3NCHbits_t CM3NCHbits __at(0xECA);
// bitfield macros
#define _CM3NCH_NCH_POSN                                    0x0
#define _CM3NCH_NCH_POSITION                                0x0
#define _CM3NCH_NCH_SIZE                                    0x3
#define _CM3NCH_NCH_LENGTH                                  0x3
#define _CM3NCH_NCH_MASK                                    0x7
#define _CM3NCH_NCH0_POSN                                   0x0
#define _CM3NCH_NCH0_POSITION                               0x0
#define _CM3NCH_NCH0_SIZE                                   0x1
#define _CM3NCH_NCH0_LENGTH                                 0x1
#define _CM3NCH_NCH0_MASK                                   0x1
#define _CM3NCH_NCH1_POSN                                   0x1
#define _CM3NCH_NCH1_POSITION                               0x1
#define _CM3NCH_NCH1_SIZE                                   0x1
#define _CM3NCH_NCH1_LENGTH                                 0x1
#define _CM3NCH_NCH1_MASK                                   0x2
#define _CM3NCH_NCH2_POSN                                   0x2
#define _CM3NCH_NCH2_POSITION                               0x2
#define _CM3NCH_NCH2_SIZE                                   0x1
#define _CM3NCH_NCH2_LENGTH                                 0x1
#define _CM3NCH_NCH2_MASK                                   0x4
#define _CM3NCH_C3NCH0_POSN                                 0x0
#define _CM3NCH_C3NCH0_POSITION                             0x0
#define _CM3NCH_C3NCH0_SIZE                                 0x1
#define _CM3NCH_C3NCH0_LENGTH                               0x1
#define _CM3NCH_C3NCH0_MASK                                 0x1
#define _CM3NCH_C3NCH1_POSN                                 0x1
#define _CM3NCH_C3NCH1_POSITION                             0x1
#define _CM3NCH_C3NCH1_SIZE                                 0x1
#define _CM3NCH_C3NCH1_LENGTH                               0x1
#define _CM3NCH_C3NCH1_MASK                                 0x2
#define _CM3NCH_C3NCH2_POSN                                 0x2
#define _CM3NCH_C3NCH2_POSITION                             0x2
#define _CM3NCH_C3NCH2_SIZE                                 0x1
#define _CM3NCH_C3NCH2_LENGTH                               0x1
#define _CM3NCH_C3NCH2_MASK                                 0x4

// Register: CM3PCH
#define CM3PCH CM3PCH
extern volatile unsigned char           CM3PCH              __at(0xECB);
#ifndef _LIB_BUILD
asm("CM3PCH equ 0ECBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :3;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
    };
    struct {
        unsigned C3PCH0                 :1;
        unsigned C3PCH1                 :1;
        unsigned C3PCH2                 :1;
    };
} CM3PCHbits_t;
extern volatile CM3PCHbits_t CM3PCHbits __at(0xECB);
// bitfield macros
#define _CM3PCH_PCH_POSN                                    0x0
#define _CM3PCH_PCH_POSITION                                0x0
#define _CM3PCH_PCH_SIZE                                    0x3
#define _CM3PCH_PCH_LENGTH                                  0x3
#define _CM3PCH_PCH_MASK                                    0x7
#define _CM3PCH_PCH0_POSN                                   0x0
#define _CM3PCH_PCH0_POSITION                               0x0
#define _CM3PCH_PCH0_SIZE                                   0x1
#define _CM3PCH_PCH0_LENGTH                                 0x1
#define _CM3PCH_PCH0_MASK                                   0x1
#define _CM3PCH_PCH1_POSN                                   0x1
#define _CM3PCH_PCH1_POSITION                               0x1
#define _CM3PCH_PCH1_SIZE                                   0x1
#define _CM3PCH_PCH1_LENGTH                                 0x1
#define _CM3PCH_PCH1_MASK                                   0x2
#define _CM3PCH_PCH2_POSN                                   0x2
#define _CM3PCH_PCH2_POSITION                               0x2
#define _CM3PCH_PCH2_SIZE                                   0x1
#define _CM3PCH_PCH2_LENGTH                                 0x1
#define _CM3PCH_PCH2_MASK                                   0x4
#define _CM3PCH_C3PCH0_POSN                                 0x0
#define _CM3PCH_C3PCH0_POSITION                             0x0
#define _CM3PCH_C3PCH0_SIZE                                 0x1
#define _CM3PCH_C3PCH0_LENGTH                               0x1
#define _CM3PCH_C3PCH0_MASK                                 0x1
#define _CM3PCH_C3PCH1_POSN                                 0x1
#define _CM3PCH_C3PCH1_POSITION                             0x1
#define _CM3PCH_C3PCH1_SIZE                                 0x1
#define _CM3PCH_C3PCH1_LENGTH                               0x1
#define _CM3PCH_C3PCH1_MASK                                 0x2
#define _CM3PCH_C3PCH2_POSN                                 0x2
#define _CM3PCH_C3PCH2_POSITION                             0x2
#define _CM3PCH_C3PCH2_SIZE                                 0x1
#define _CM3PCH_C3PCH2_LENGTH                               0x1
#define _CM3PCH_C3PCH2_MASK                                 0x4

// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0xECC);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 0ECCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :2;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned C2SYNC                 :1;
        unsigned C2HYS                  :1;
        unsigned                        :2;
        unsigned C2POL                  :1;
        unsigned                        :1;
        unsigned C2OUT                  :1;
        unsigned C2EN                   :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0xECC);
// bitfield macros
#define _CM2CON0_SYNC_POSN                                  0x0
#define _CM2CON0_SYNC_POSITION                              0x0
#define _CM2CON0_SYNC_SIZE                                  0x1
#define _CM2CON0_SYNC_LENGTH                                0x1
#define _CM2CON0_SYNC_MASK                                  0x1
#define _CM2CON0_HYS_POSN                                   0x1
#define _CM2CON0_HYS_POSITION                               0x1
#define _CM2CON0_HYS_SIZE                                   0x1
#define _CM2CON0_HYS_LENGTH                                 0x1
#define _CM2CON0_HYS_MASK                                   0x2
#define _CM2CON0_POL_POSN                                   0x4
#define _CM2CON0_POL_POSITION                               0x4
#define _CM2CON0_POL_SIZE                                   0x1
#define _CM2CON0_POL_LENGTH                                 0x1
#define _CM2CON0_POL_MASK                                   0x10
#define _CM2CON0_OUT_POSN                                   0x6
#define _CM2CON0_OUT_POSITION                               0x6
#define _CM2CON0_OUT_SIZE                                   0x1
#define _CM2CON0_OUT_LENGTH                                 0x1
#define _CM2CON0_OUT_MASK                                   0x40
#define _CM2CON0_EN_POSN                                    0x7
#define _CM2CON0_EN_POSITION                                0x7
#define _CM2CON0_EN_SIZE                                    0x1
#define _CM2CON0_EN_LENGTH                                  0x1
#define _CM2CON0_EN_MASK                                    0x80
#define _CM2CON0_C2SYNC_POSN                                0x0
#define _CM2CON0_C2SYNC_POSITION                            0x0
#define _CM2CON0_C2SYNC_SIZE                                0x1
#define _CM2CON0_C2SYNC_LENGTH                              0x1
#define _CM2CON0_C2SYNC_MASK                                0x1
#define _CM2CON0_C2HYS_POSN                                 0x1
#define _CM2CON0_C2HYS_POSITION                             0x1
#define _CM2CON0_C2HYS_SIZE                                 0x1
#define _CM2CON0_C2HYS_LENGTH                               0x1
#define _CM2CON0_C2HYS_MASK                                 0x2
#define _CM2CON0_C2POL_POSN                                 0x4
#define _CM2CON0_C2POL_POSITION                             0x4
#define _CM2CON0_C2POL_SIZE                                 0x1
#define _CM2CON0_C2POL_LENGTH                               0x1
#define _CM2CON0_C2POL_MASK                                 0x10
#define _CM2CON0_C2OUT_POSN                                 0x6
#define _CM2CON0_C2OUT_POSITION                             0x6
#define _CM2CON0_C2OUT_SIZE                                 0x1
#define _CM2CON0_C2OUT_LENGTH                               0x1
#define _CM2CON0_C2OUT_MASK                                 0x40
#define _CM2CON0_C2EN_POSN                                  0x7
#define _CM2CON0_C2EN_POSITION                              0x7
#define _CM2CON0_C2EN_SIZE                                  0x1
#define _CM2CON0_C2EN_LENGTH                                0x1
#define _CM2CON0_C2EN_MASK                                  0x80

// Register: CM2CON1
#define CM2CON1 CM2CON1
extern volatile unsigned char           CM2CON1             __at(0xECD);
#ifndef _LIB_BUILD
asm("CM2CON1 equ 0ECDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C2INTN                 :1;
        unsigned C2INTP                 :1;
    };
} CM2CON1bits_t;
extern volatile CM2CON1bits_t CM2CON1bits __at(0xECD);
// bitfield macros
#define _CM2CON1_INTN_POSN                                  0x0
#define _CM2CON1_INTN_POSITION                              0x0
#define _CM2CON1_INTN_SIZE                                  0x1
#define _CM2CON1_INTN_LENGTH                                0x1
#define _CM2CON1_INTN_MASK                                  0x1
#define _CM2CON1_INTP_POSN                                  0x1
#define _CM2CON1_INTP_POSITION                              0x1
#define _CM2CON1_INTP_SIZE                                  0x1
#define _CM2CON1_INTP_LENGTH                                0x1
#define _CM2CON1_INTP_MASK                                  0x2
#define _CM2CON1_C2INTN_POSN                                0x0
#define _CM2CON1_C2INTN_POSITION                            0x0
#define _CM2CON1_C2INTN_SIZE                                0x1
#define _CM2CON1_C2INTN_LENGTH                              0x1
#define _CM2CON1_C2INTN_MASK                                0x1
#define _CM2CON1_C2INTP_POSN                                0x1
#define _CM2CON1_C2INTP_POSITION                            0x1
#define _CM2CON1_C2INTP_SIZE                                0x1
#define _CM2CON1_C2INTP_LENGTH                              0x1
#define _CM2CON1_C2INTP_MASK                                0x2

// Register: CM2NCH
#define CM2NCH CM2NCH
extern volatile unsigned char           CM2NCH              __at(0xECE);
#ifndef _LIB_BUILD
asm("CM2NCH equ 0ECEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :3;
    };
    struct {
        unsigned NCH0                   :1;
        unsigned NCH1                   :1;
        unsigned NCH2                   :1;
    };
    struct {
        unsigned C2NCH0                 :1;
        unsigned C2NCH1                 :1;
        unsigned C2NCH2                 :1;
    };
} CM2NCHbits_t;
