GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.h
// Register: T7CON
#define T7CON T7CON
extern volatile unsigned char           T7CON               __at(0xF30);
#ifndef _LIB_BUILD
asm("T7CON equ 0F30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned NOT_SYNC               :1;
    };
    struct {
        unsigned ON                     :1;
        unsigned RD16                   :1;
        unsigned nSYNC                  :1;
        unsigned                        :1;
        unsigned CKPS                   :2;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_T7SYNC             :1;
    };
    struct {
        unsigned TMR7ON                 :1;
        unsigned T7RD16                 :1;
        unsigned nT7SYNC                :1;
        unsigned                        :1;
        unsigned T7CKPS0                :1;
        unsigned T7CKPS1                :1;
    };
    struct {
        unsigned                        :4;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RD167                  :1;
    };
} T7CONbits_t;
extern volatile T7CONbits_t T7CONbits __at(0xF30);
// bitfield macros
#define _T7CON_NOT_SYNC_POSN                                0x2
#define _T7CON_NOT_SYNC_POSITION                            0x2
#define _T7CON_NOT_SYNC_SIZE                                0x1
#define _T7CON_NOT_SYNC_LENGTH                              0x1
#define _T7CON_NOT_SYNC_MASK                                0x4
#define _T7CON_ON_POSN                                      0x0
#define _T7CON_ON_POSITION                                  0x0
#define _T7CON_ON_SIZE                                      0x1
#define _T7CON_ON_LENGTH                                    0x1
#define _T7CON_ON_MASK                                      0x1
#define _T7CON_RD16_POSN                                    0x1
#define _T7CON_RD16_POSITION                                0x1
#define _T7CON_RD16_SIZE                                    0x1
#define _T7CON_RD16_LENGTH                                  0x1
#define _T7CON_RD16_MASK                                    0x2
#define _T7CON_nSYNC_POSN                                   0x2
#define _T7CON_nSYNC_POSITION                               0x2
#define _T7CON_nSYNC_SIZE                                   0x1
#define _T7CON_nSYNC_LENGTH                                 0x1
#define _T7CON_nSYNC_MASK                                   0x4
#define _T7CON_CKPS_POSN                                    0x4
#define _T7CON_CKPS_POSITION                                0x4
#define _T7CON_CKPS_SIZE                                    0x2
#define _T7CON_CKPS_LENGTH                                  0x2
#define _T7CON_CKPS_MASK                                    0x30
#define _T7CON_NOT_T7SYNC_POSN                              0x2
#define _T7CON_NOT_T7SYNC_POSITION                          0x2
#define _T7CON_NOT_T7SYNC_SIZE                              0x1
#define _T7CON_NOT_T7SYNC_LENGTH                            0x1
#define _T7CON_NOT_T7SYNC_MASK                              0x4
#define _T7CON_TMR7ON_POSN                                  0x0
#define _T7CON_TMR7ON_POSITION                              0x0
#define _T7CON_TMR7ON_SIZE                                  0x1
#define _T7CON_TMR7ON_LENGTH                                0x1
#define _T7CON_TMR7ON_MASK                                  0x1
#define _T7CON_T7RD16_POSN                                  0x1
#define _T7CON_T7RD16_POSITION                              0x1
#define _T7CON_T7RD16_SIZE                                  0x1
#define _T7CON_T7RD16_LENGTH                                0x1
#define _T7CON_T7RD16_MASK                                  0x2
#define _T7CON_nT7SYNC_POSN                                 0x2
#define _T7CON_nT7SYNC_POSITION                             0x2
#define _T7CON_nT7SYNC_SIZE                                 0x1
#define _T7CON_nT7SYNC_LENGTH                               0x1
#define _T7CON_nT7SYNC_MASK                                 0x4
#define _T7CON_T7CKPS0_POSN                                 0x4
#define _T7CON_T7CKPS0_POSITION                             0x4
#define _T7CON_T7CKPS0_SIZE                                 0x1
#define _T7CON_T7CKPS0_LENGTH                               0x1
#define _T7CON_T7CKPS0_MASK                                 0x10
#define _T7CON_T7CKPS1_POSN                                 0x5
#define _T7CON_T7CKPS1_POSITION                             0x5
#define _T7CON_T7CKPS1_SIZE                                 0x1
#define _T7CON_T7CKPS1_LENGTH                               0x1
#define _T7CON_T7CKPS1_MASK                                 0x20
#define _T7CON_CKPS0_POSN                                   0x4
#define _T7CON_CKPS0_POSITION                               0x4
#define _T7CON_CKPS0_SIZE                                   0x1
#define _T7CON_CKPS0_LENGTH                                 0x1
#define _T7CON_CKPS0_MASK                                   0x10
#define _T7CON_CKPS1_POSN                                   0x5
#define _T7CON_CKPS1_POSITION                               0x5
#define _T7CON_CKPS1_SIZE                                   0x1
#define _T7CON_CKPS1_LENGTH                                 0x1
#define _T7CON_CKPS1_MASK                                   0x20
#define _T7CON_RD167_POSN                                   0x1
#define _T7CON_RD167_POSITION                               0x1
#define _T7CON_RD167_SIZE                                   0x1
#define _T7CON_RD167_LENGTH                                 0x1
#define _T7CON_RD167_MASK                                   0x2

// Register: T7GCON
#define T7GCON T7GCON
extern volatile unsigned char           T7GCON              __at(0xF31);
#ifndef _LIB_BUILD
asm("T7GCON equ 0F31h");
#endif
// aliases
extern volatile unsigned char           PR7                 __at(0xF31);
#ifndef _LIB_BUILD
asm("PR7 equ 0F31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned GGO_NOT_DONE           :1;
    };
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :3;
        unsigned T7GGO_NOT_DONE         :1;
    };
    struct {
        unsigned                        :2;
        unsigned T7GVAL                 :1;
        unsigned T7GGO_nDONE            :1;
        unsigned T7GSPM                 :1;
        unsigned T7GTM                  :1;
        unsigned T7GPOL                 :1;
        unsigned T7GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned T7GGO                  :1;
    };
} T7GCONbits_t;
