GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.h
extern volatile __bit                   ADRPT4              __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 ADRPT4_bit          _BIT_ACCESS(ADRPT,4)
// ADRPT<ADRPT5>
extern volatile __bit                   ADRPT5              __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 ADRPT5_bit          _BIT_ACCESS(ADRPT,5)
// ADRPT<ADRPT6>
extern volatile __bit                   ADRPT6              __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 ADRPT6_bit          _BIT_ACCESS(ADRPT,6)
// ADRPT<ADRPT7>
extern volatile __bit                   ADRPT7              __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 ADRPT7_bit          _BIT_ACCESS(ADRPT,7)
// ADCON3<ADSOI>
extern volatile __bit                   ADSOI               __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 ADSOI_bit           _BIT_ACCESS(ADCON3,3)
// ADSTAT<ADSTAT0>
extern volatile __bit                   ADSTAT0             __at(0x7B28);	// @ (0xF65 * 8 + 0)
#define                                 ADSTAT0_bit         _BIT_ACCESS(ADSTAT,0)
// ADSTAT<ADSTAT1>
extern volatile __bit                   ADSTAT1             __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 ADSTAT1_bit         _BIT_ACCESS(ADSTAT,1)
// ADSTAT<ADSTAT2>
extern volatile __bit                   ADSTAT2             __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 ADSTAT2_bit         _BIT_ACCESS(ADSTAT,2)
// ADSTPTL<ADSTPT0>
extern volatile __bit                   ADSTPT0             __at(0x7B40);	// @ (0xF68 * 8 + 0)
#define                                 ADSTPT0_bit         _BIT_ACCESS(ADSTPTL,0)
// ADSTPTL<ADSTPT1>
extern volatile __bit                   ADSTPT1             __at(0x7B41);	// @ (0xF68 * 8 + 1)
#define                                 ADSTPT1_bit         _BIT_ACCESS(ADSTPTL,1)
// ADSTPTH<ADSTPT10>
extern volatile __bit                   ADSTPT10            __at(0x7B4A);	// @ (0xF69 * 8 + 2)
#define                                 ADSTPT10_bit        _BIT_ACCESS(ADSTPTH,2)
// ADSTPTH<ADSTPT11>
extern volatile __bit                   ADSTPT11            __at(0x7B4B);	// @ (0xF69 * 8 + 3)
#define                                 ADSTPT11_bit        _BIT_ACCESS(ADSTPTH,3)
// ADSTPTH<ADSTPT12>
extern volatile __bit                   ADSTPT12            __at(0x7B4C);	// @ (0xF69 * 8 + 4)
#define                                 ADSTPT12_bit        _BIT_ACCESS(ADSTPTH,4)
// ADSTPTH<ADSTPT13>
extern volatile __bit                   ADSTPT13            __at(0x7B4D);	// @ (0xF69 * 8 + 5)
#define                                 ADSTPT13_bit        _BIT_ACCESS(ADSTPTH,5)
// ADSTPTH<ADSTPT14>
extern volatile __bit                   ADSTPT14            __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 ADSTPT14_bit        _BIT_ACCESS(ADSTPTH,6)
// ADSTPTH<ADSTPT15>
extern volatile __bit                   ADSTPT15            __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 ADSTPT15_bit        _BIT_ACCESS(ADSTPTH,7)
// ADSTPTL<ADSTPT2>
extern volatile __bit                   ADSTPT2             __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 ADSTPT2_bit         _BIT_ACCESS(ADSTPTL,2)
// ADSTPTL<ADSTPT3>
extern volatile __bit                   ADSTPT3             __at(0x7B43);	// @ (0xF68 * 8 + 3)
#define                                 ADSTPT3_bit         _BIT_ACCESS(ADSTPTL,3)
// ADSTPTL<ADSTPT4>
extern volatile __bit                   ADSTPT4             __at(0x7B44);	// @ (0xF68 * 8 + 4)
#define                                 ADSTPT4_bit         _BIT_ACCESS(ADSTPTL,4)
// ADSTPTL<ADSTPT5>
extern volatile __bit                   ADSTPT5             __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 ADSTPT5_bit         _BIT_ACCESS(ADSTPTL,5)
// ADSTPTL<ADSTPT6>
extern volatile __bit                   ADSTPT6             __at(0x7B46);	// @ (0xF68 * 8 + 6)
#define                                 ADSTPT6_bit         _BIT_ACCESS(ADSTPTL,6)
// ADSTPTL<ADSTPT7>
extern volatile __bit                   ADSTPT7             __at(0x7B47);	// @ (0xF68 * 8 + 7)
#define                                 ADSTPT7_bit         _BIT_ACCESS(ADSTPTL,7)
// ADSTPTH<ADSTPT8>
extern volatile __bit                   ADSTPT8             __at(0x7B48);	// @ (0xF69 * 8 + 0)
#define                                 ADSTPT8_bit         _BIT_ACCESS(ADSTPTH,0)
// ADSTPTH<ADSTPT9>
extern volatile __bit                   ADSTPT9             __at(0x7B49);	// @ (0xF69 * 8 + 1)
#define                                 ADSTPT9_bit         _BIT_ACCESS(ADSTPTH,1)
// PIE1<ADTIE>
extern volatile __bit                   ADTIE               __at(0x7151);	// @ (0xE2A * 8 + 1)
#define                                 ADTIE_bit           _BIT_ACCESS(PIE1,1)
// PIR1<ADTIF>
extern volatile __bit                   ADTIF               __at(0x71A1);	// @ (0xE34 * 8 + 1)
#define                                 ADTIF_bit           _BIT_ACCESS(PIR1,1)
// IPR1<ADTIP>
extern volatile __bit                   ADTIP               __at(0x7101);	// @ (0xE20 * 8 + 1)
#define                                 ADTIP_bit           _BIT_ACCESS(IPR1,1)
// ADCON3<ADTMD0>
extern volatile __bit                   ADTMD0              __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 ADTMD0_bit          _BIT_ACCESS(ADCON3,0)
// ADCON3<ADTMD1>
extern volatile __bit                   ADTMD1              __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 ADTMD1_bit          _BIT_ACCESS(ADCON3,1)
// ADCON3<ADTMD2>
extern volatile __bit                   ADTMD2              __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 ADTMD2_bit          _BIT_ACCESS(ADCON3,2)
// ADUTHL<ADUTH0>
extern volatile __bit                   ADUTH0              __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 ADUTH0_bit          _BIT_ACCESS(ADUTHL,0)
// ADUTHL<ADUTH1>
extern volatile __bit                   ADUTH1              __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 ADUTH1_bit          _BIT_ACCESS(ADUTHL,1)
// ADUTHH<ADUTH10>
extern volatile __bit                   ADUTH10             __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 ADUTH10_bit         _BIT_ACCESS(ADUTHH,2)
// ADUTHH<ADUTH11>
extern volatile __bit                   ADUTH11             __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 ADUTH11_bit         _BIT_ACCESS(ADUTHH,3)
// ADUTHH<ADUTH12>
extern volatile __bit                   ADUTH12             __at(0x7B6C);	// @ (0xF6D * 8 + 4)
#define                                 ADUTH12_bit         _BIT_ACCESS(ADUTHH,4)
// ADUTHH<ADUTH13>
extern volatile __bit                   ADUTH13             __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 ADUTH13_bit         _BIT_ACCESS(ADUTHH,5)
// ADUTHH<ADUTH14>
extern volatile __bit                   ADUTH14             __at(0x7B6E);	// @ (0xF6D * 8 + 6)
#define                                 ADUTH14_bit         _BIT_ACCESS(ADUTHH,6)
// ADUTHH<ADUTH15>
extern volatile __bit                   ADUTH15             __at(0x7B6F);	// @ (0xF6D * 8 + 7)
#define                                 ADUTH15_bit         _BIT_ACCESS(ADUTHH,7)
// ADUTHL<ADUTH2>
extern volatile __bit                   ADUTH2              __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 ADUTH2_bit          _BIT_ACCESS(ADUTHL,2)
// ADUTHL<ADUTH3>
extern volatile __bit                   ADUTH3              __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 ADUTH3_bit          _BIT_ACCESS(ADUTHL,3)
// ADUTHL<ADUTH4>
extern volatile __bit                   ADUTH4              __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 ADUTH4_bit          _BIT_ACCESS(ADUTHL,4)
// ADUTHL<ADUTH5>
extern volatile __bit                   ADUTH5              __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 ADUTH5_bit          _BIT_ACCESS(ADUTHL,5)
// ADUTHL<ADUTH6>
extern volatile __bit                   ADUTH6              __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 ADUTH6_bit          _BIT_ACCESS(ADUTHL,6)
// ADUTHL<ADUTH7>
extern volatile __bit                   ADUTH7              __at(0x7B67);	// @ (0xF6C * 8 + 7)
#define                                 ADUTH7_bit          _BIT_ACCESS(ADUTHL,7)
// ADUTHH<ADUTH8>
extern volatile __bit                   ADUTH8              __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 ADUTH8_bit          _BIT_ACCESS(ADUTHH,0)
// ADUTHH<ADUTH9>
extern volatile __bit                   ADUTH9              __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 ADUTH9_bit          _BIT_ACCESS(ADUTHH,1)
// ADSTAT<ADUTHR>
extern volatile __bit                   ADUTHR              __at(0x7B2E);	// @ (0xF65 * 8 + 6)
#define                                 ADUTHR_bit          _BIT_ACCESS(ADSTAT,6)
// ANSELA<ANSELA0>
extern volatile __bit                   ANSELA0             __at(0x7490);	// @ (0xE92 * 8 + 0)
#define                                 ANSELA0_bit         _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSELA1>
extern volatile __bit                   ANSELA1             __at(0x7491);	// @ (0xE92 * 8 + 1)
#define                                 ANSELA1_bit         _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSELA2>
extern volatile __bit                   ANSELA2             __at(0x7492);	// @ (0xE92 * 8 + 2)
#define                                 ANSELA2_bit         _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSELA3>
extern volatile __bit                   ANSELA3             __at(0x7493);	// @ (0xE92 * 8 + 3)
#define                                 ANSELA3_bit         _BIT_ACCESS(ANSELA,3)
// ANSELA<ANSELA4>
extern volatile __bit                   ANSELA4             __at(0x7494);	// @ (0xE92 * 8 + 4)
#define                                 ANSELA4_bit         _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSELA5>
extern volatile __bit                   ANSELA5             __at(0x7495);	// @ (0xE92 * 8 + 5)
#define                                 ANSELA5_bit         _BIT_ACCESS(ANSELA,5)
// ANSELA<ANSELA6>
extern volatile __bit                   ANSELA6             __at(0x7496);	// @ (0xE92 * 8 + 6)
#define                                 ANSELA6_bit         _BIT_ACCESS(ANSELA,6)
// ANSELA<ANSELA7>
extern volatile __bit                   ANSELA7             __at(0x7497);	// @ (0xE92 * 8 + 7)
#define                                 ANSELA7_bit         _BIT_ACCESS(ANSELA,7)
// ANSELB<ANSELB0>
extern volatile __bit                   ANSELB0             __at(0x74D0);	// @ (0xE9A * 8 + 0)
#define                                 ANSELB0_bit         _BIT_ACCESS(ANSELB,0)
// ANSELB<ANSELB1>
extern volatile __bit                   ANSELB1             __at(0x74D1);	// @ (0xE9A * 8 + 1)
#define                                 ANSELB1_bit         _BIT_ACCESS(ANSELB,1)
// ANSELB<ANSELB2>
extern volatile __bit                   ANSELB2             __at(0x74D2);	// @ (0xE9A * 8 + 2)
#define                                 ANSELB2_bit         _BIT_ACCESS(ANSELB,2)
// ANSELB<ANSELB3>
extern volatile __bit                   ANSELB3             __at(0x74D3);	// @ (0xE9A * 8 + 3)
#define                                 ANSELB3_bit         _BIT_ACCESS(ANSELB,3)
// ANSELB<ANSELB4>
extern volatile __bit                   ANSELB4             __at(0x74D4);	// @ (0xE9A * 8 + 4)
#define                                 ANSELB4_bit         _BIT_ACCESS(ANSELB,4)
// ANSELB<ANSELB5>
extern volatile __bit                   ANSELB5             __at(0x74D5);	// @ (0xE9A * 8 + 5)
#define                                 ANSELB5_bit         _BIT_ACCESS(ANSELB,5)
// ANSELB<ANSELB6>
extern volatile __bit                   ANSELB6             __at(0x74D6);	// @ (0xE9A * 8 + 6)
#define                                 ANSELB6_bit         _BIT_ACCESS(ANSELB,6)
// ANSELB<ANSELB7>
extern volatile __bit                   ANSELB7             __at(0x74D7);	// @ (0xE9A * 8 + 7)
#define                                 ANSELB7_bit         _BIT_ACCESS(ANSELB,7)
// ANSELD<ANSELD0>
extern volatile __bit                   ANSELD0             __at(0x7538);	// @ (0xEA7 * 8 + 0)
#define                                 ANSELD0_bit         _BIT_ACCESS(ANSELD,0)
// ANSELD<ANSELD1>
extern volatile __bit                   ANSELD1             __at(0x7539);	// @ (0xEA7 * 8 + 1)
#define                                 ANSELD1_bit         _BIT_ACCESS(ANSELD,1)
// ANSELD<ANSELD2>
extern volatile __bit                   ANSELD2             __at(0x753A);	// @ (0xEA7 * 8 + 2)
#define                                 ANSELD2_bit         _BIT_ACCESS(ANSELD,2)
// ANSELD<ANSELD3>
extern volatile __bit                   ANSELD3             __at(0x753B);	// @ (0xEA7 * 8 + 3)
#define                                 ANSELD3_bit         _BIT_ACCESS(ANSELD,3)
// ANSELD<ANSELD4>
extern volatile __bit                   ANSELD4             __at(0x753C);	// @ (0xEA7 * 8 + 4)
#define                                 ANSELD4_bit         _BIT_ACCESS(ANSELD,4)
// ANSELD<ANSELD5>
extern volatile __bit                   ANSELD5             __at(0x753D);	// @ (0xEA7 * 8 + 5)
#define                                 ANSELD5_bit         _BIT_ACCESS(ANSELD,5)
// ANSELD<ANSELD6>
extern volatile __bit                   ANSELD6             __at(0x753E);	// @ (0xEA7 * 8 + 6)
#define                                 ANSELD6_bit         _BIT_ACCESS(ANSELD,6)
// ANSELD<ANSELD7>
extern volatile __bit                   ANSELD7             __at(0x753F);	// @ (0xEA7 * 8 + 7)
#define                                 ANSELD7_bit         _BIT_ACCESS(ANSELD,7)
// ANSELE<ANSELE0>
extern volatile __bit                   ANSELE0             __at(0x7578);	// @ (0xEAF * 8 + 0)
#define                                 ANSELE0_bit         _BIT_ACCESS(ANSELE,0)
// ANSELE<ANSELE1>
extern volatile __bit                   ANSELE1             __at(0x7579);	// @ (0xEAF * 8 + 1)
#define                                 ANSELE1_bit         _BIT_ACCESS(ANSELE,1)
// ANSELE<ANSELE2>
extern volatile __bit                   ANSELE2             __at(0x757A);	// @ (0xEAF * 8 + 2)
#define                                 ANSELE2_bit         _BIT_ACCESS(ANSELE,2)
// ANSELE<ANSELE3>
extern volatile __bit                   ANSELE3             __at(0x757B);	// @ (0xEAF * 8 + 3)
#define                                 ANSELE3_bit         _BIT_ACCESS(ANSELE,3)
// ANSELE<ANSELE4>
extern volatile __bit                   ANSELE4             __at(0x757C);	// @ (0xEAF * 8 + 4)
#define                                 ANSELE4_bit         _BIT_ACCESS(ANSELE,4)
// ANSELE<ANSELE5>
extern volatile __bit                   ANSELE5             __at(0x757D);	// @ (0xEAF * 8 + 5)
#define                                 ANSELE5_bit         _BIT_ACCESS(ANSELE,5)
// ANSELE<ANSELE6>
extern volatile __bit                   ANSELE6             __at(0x757E);	// @ (0xEAF * 8 + 6)
#define                                 ANSELE6_bit         _BIT_ACCESS(ANSELE,6)
// ANSELE<ANSELE7>
extern volatile __bit                   ANSELE7             __at(0x757F);	// @ (0xEAF * 8 + 7)
#define                                 ANSELE7_bit         _BIT_ACCESS(ANSELE,7)
// ANSELF<ANSELF0>
extern volatile __bit                   ANSELF0             __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 ANSELF0_bit         _BIT_ACCESS(ANSELF,0)
// ANSELF<ANSELF1>
extern volatile __bit                   ANSELF1             __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 ANSELF1_bit         _BIT_ACCESS(ANSELF,1)
// ANSELF<ANSELF2>
extern volatile __bit                   ANSELF2             __at(0x75A2);	// @ (0xEB4 * 8 + 2)
#define                                 ANSELF2_bit         _BIT_ACCESS(ANSELF,2)
// ANSELF<ANSELF3>
extern volatile __bit                   ANSELF3             __at(0x75A3);	// @ (0xEB4 * 8 + 3)
#define                                 ANSELF3_bit         _BIT_ACCESS(ANSELF,3)
// ANSELF<ANSELF4>
extern volatile __bit                   ANSELF4             __at(0x75A4);	// @ (0xEB4 * 8 + 4)
#define                                 ANSELF4_bit         _BIT_ACCESS(ANSELF,4)
// ANSELF<ANSELF5>
extern volatile __bit                   ANSELF5             __at(0x75A5);	// @ (0xEB4 * 8 + 5)
#define                                 ANSELF5_bit         _BIT_ACCESS(ANSELF,5)
// ANSELF<ANSELF6>
extern volatile __bit                   ANSELF6             __at(0x75A6);	// @ (0xEB4 * 8 + 6)
#define                                 ANSELF6_bit         _BIT_ACCESS(ANSELF,6)
// ANSELF<ANSELF7>
extern volatile __bit                   ANSELF7             __at(0x75A7);	// @ (0xEB4 * 8 + 7)
#define                                 ANSELF7_bit         _BIT_ACCESS(ANSELF,7)
// ANSELG<ANSELG0>
extern volatile __bit                   ANSELG0             __at(0x75E0);	// @ (0xEBC * 8 + 0)
#define                                 ANSELG0_bit         _BIT_ACCESS(ANSELG,0)
// ANSELG<ANSELG1>
extern volatile __bit                   ANSELG1             __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 ANSELG1_bit         _BIT_ACCESS(ANSELG,1)
// ANSELG<ANSELG2>
extern volatile __bit                   ANSELG2             __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 ANSELG2_bit         _BIT_ACCESS(ANSELG,2)
// ANSELG<ANSELG3>
extern volatile __bit                   ANSELG3             __at(0x75E3);	// @ (0xEBC * 8 + 3)
#define                                 ANSELG3_bit         _BIT_ACCESS(ANSELG,3)
// ANSELG<ANSELG4>
extern volatile __bit                   ANSELG4             __at(0x75E4);	// @ (0xEBC * 8 + 4)
#define                                 ANSELG4_bit         _BIT_ACCESS(ANSELG,4)
// ANSELG<ANSELG6>
extern volatile __bit                   ANSELG6             __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 ANSELG6_bit         _BIT_ACCESS(ANSELG,6)
// ANSELG<ANSELG7>
extern volatile __bit                   ANSELG7             __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 ANSELG7_bit         _BIT_ACCESS(ANSELG,7)
// CWG1AS1<AS0E>
extern volatile __bit                   AS0E                __at(0x79E8);	// @ (0xF3D * 8 + 0)
#define                                 AS0E_bit            _BIT_ACCESS(CWG1AS1,0)
// CWG1AS1<AS1E>
extern volatile __bit                   AS1E                __at(0x79E9);	// @ (0xF3D * 8 + 1)
#define                                 AS1E_bit            _BIT_ACCESS(CWG1AS1,1)
// CWG1AS1<AS2E>
extern volatile __bit                   AS2E                __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 AS2E_bit            _BIT_ACCESS(CWG1AS1,2)
// CWG1AS1<AS3E>
extern volatile __bit                   AS3E                __at(0x79EB);	// @ (0xF3D * 8 + 3)
#define                                 AS3E_bit            _BIT_ACCESS(CWG1AS1,3)
// CWG1AS1<AS4E>
extern volatile __bit                   AS4E                __at(0x79EC);	// @ (0xF3D * 8 + 4)
#define                                 AS4E_bit            _BIT_ACCESS(CWG1AS1,4)
// CWG1AS1<AS5E>
extern volatile __bit                   AS5E                __at(0x79ED);	// @ (0xF3D * 8 + 5)
#define                                 AS5E_bit            _BIT_ACCESS(CWG1AS1,5)
// CWG1AS1<AS6E>
extern volatile __bit                   AS6E                __at(0x79EE);	// @ (0xF3D * 8 + 6)
#define                                 AS6E_bit            _BIT_ACCESS(CWG1AS1,6)
// CWG1AS1<AS7E>
extern volatile __bit                   AS7E                __at(0x79EF);	// @ (0xF3D * 8 + 7)
#define                                 AS7E_bit            _BIT_ACCESS(CWG1AS1,7)
// PIE3<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x7161);	// @ (0xE2C * 8 + 1)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x71B1);	// @ (0xE36 * 8 + 1)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<BCL1IP>
extern volatile __bit                   BCL1IP              __at(0x7111);	// @ (0xE22 * 8 + 1)
#define                                 BCL1IP_bit          _BIT_ACCESS(IPR3,1)
// PIE3<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x7163);	// @ (0xE2C * 8 + 3)
#define                                 BCL2IE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0x71B3);	// @ (0xE36 * 8 + 3)
#define                                 BCL2IF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<BCL2IP>
extern volatile __bit                   BCL2IP              __at(0x7113);	// @ (0xE22 * 8 + 3)
#define                                 BCL2IP_bit          _BIT_ACCESS(IPR3,3)
// SSP1STAT<BF1>
extern volatile __bit                   BF1                 __at(0x7CA0);	// @ (0xF94 * 8 + 0)
#define                                 BF1_bit             _BIT_ACCESS(SSP1STAT,0)
// SSP2STAT<BF2>
extern volatile __bit                   BF2                 __at(0x76C0);	// @ (0xED8 * 8 + 0)
#define                                 BF2_bit             _BIT_ACCESS(SSP2STAT,0)
// MDCON0<BIT>
extern volatile __bit                   BIT                 __at(0x7A88);	// @ (0xF51 * 8 + 0)
#define                                 BIT_bit             _BIT_ACCESS(MDCON0,0)
// PCON0<BOR>
extern volatile __bit                   BOR                 __at(0x7EB8);	// @ (0xFD7 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(PCON0,0)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x7258);	// @ (0xE4B * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BAUD1CON<BRG161>
extern volatile __bit                   BRG161              __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 BRG161_bit          _BIT_ACCESS(BAUD1CON,3)
// BAUD2CON<BRG162>
extern volatile __bit                   BRG162              __at(0x77BB);	// @ (0xEF7 * 8 + 3)
#define                                 BRG162_bit          _BIT_ACCESS(BAUD2CON,3)
// TX1STA<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TX1STA,2)
// CM1CON0<C1EN>
extern volatile __bit                   C1EN                __at(0x7687);	// @ (0xED0 * 8 + 7)
#define                                 C1EN_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x7681);	// @ (0xED0 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x7158);	// @ (0xE2B * 8 + 0)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,0)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x71A8);	// @ (0xE35 * 8 + 0)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,0)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x7688);	// @ (0xED1 * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x7689);	// @ (0xED1 * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// IPR2<C1IP>
extern volatile __bit                   C1IP                __at(0x7108);	// @ (0xE21 * 8 + 0)
