GopalSaraf/Practicals/PSDL/include/proc/pic18f65k40.h
// T7GATE<T7GSS3>
extern volatile __bit                   T7GSS3              __at(0x7993);	// @ (0xF32 * 8 + 3)
#define                                 T7GSS3_bit          _BIT_ACCESS(T7GATE,3)
// T7GATE<T7GSS4>
extern volatile __bit                   T7GSS4              __at(0x7994);	// @ (0xF32 * 8 + 4)
#define                                 T7GSS4_bit          _BIT_ACCESS(T7GATE,4)
// T7GCON<T7GTM>
extern volatile __bit                   T7GTM               __at(0x798D);	// @ (0xF31 * 8 + 5)
#define                                 T7GTM_bit           _BIT_ACCESS(T7GCON,5)
// T7GCON<T7GVAL>
extern volatile __bit                   T7GVAL              __at(0x798A);	// @ (0xF31 * 8 + 2)
#define                                 T7GVAL_bit          _BIT_ACCESS(T7GCON,2)
// T7CON<T7RD16>
extern volatile __bit                   T7RD16              __at(0x7981);	// @ (0xF30 * 8 + 1)
#define                                 T7RD16_bit          _BIT_ACCESS(T7CON,1)
// T8HLT<T8CKPOL>
extern volatile __bit                   T8CKPOL             __at(0x795E);	// @ (0xF2B * 8 + 6)
#define                                 T8CKPOL_bit         _BIT_ACCESS(T8HLT,6)
// T8CON<T8CKPS0>
extern volatile __bit                   T8CKPS0             __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 T8CKPS0_bit         _BIT_ACCESS(T8CON,4)
// T8CON<T8CKPS1>
extern volatile __bit                   T8CKPS1             __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 T8CKPS1_bit         _BIT_ACCESS(T8CON,5)
// T8CON<T8CKPS2>
extern volatile __bit                   T8CKPS2             __at(0x7956);	// @ (0xF2A * 8 + 6)
#define                                 T8CKPS2_bit         _BIT_ACCESS(T8CON,6)
// T8HLT<T8CKSYNC>
extern volatile __bit                   T8CKSYNC            __at(0x795D);	// @ (0xF2B * 8 + 5)
#define                                 T8CKSYNC_bit        _BIT_ACCESS(T8HLT,5)
// T8CLKCON<T8CS0>
extern volatile __bit                   T8CS0               __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 T8CS0_bit           _BIT_ACCESS(T8CLKCON,0)
// T8CLKCON<T8CS1>
extern volatile __bit                   T8CS1               __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 T8CS1_bit           _BIT_ACCESS(T8CLKCON,1)
// T8CLKCON<T8CS2>
extern volatile __bit                   T8CS2               __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 T8CS2_bit           _BIT_ACCESS(T8CLKCON,2)
// T8CLKCON<T8CS3>
extern volatile __bit                   T8CS3               __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 T8CS3_bit           _BIT_ACCESS(T8CLKCON,3)
// T8INPPS<T8INPPS0>
extern volatile __bit                   T8INPPS0            __at(0x7000);	// @ (0xE00 * 8 + 0)
#define                                 T8INPPS0_bit        _BIT_ACCESS(T8INPPS,0)
// T8INPPS<T8INPPS1>
extern volatile __bit                   T8INPPS1            __at(0x7001);	// @ (0xE00 * 8 + 1)
#define                                 T8INPPS1_bit        _BIT_ACCESS(T8INPPS,1)
// T8INPPS<T8INPPS2>
extern volatile __bit                   T8INPPS2            __at(0x7002);	// @ (0xE00 * 8 + 2)
#define                                 T8INPPS2_bit        _BIT_ACCESS(T8INPPS,2)
// T8INPPS<T8INPPS3>
extern volatile __bit                   T8INPPS3            __at(0x7003);	// @ (0xE00 * 8 + 3)
#define                                 T8INPPS3_bit        _BIT_ACCESS(T8INPPS,3)
// T8INPPS<T8INPPS4>
extern volatile __bit                   T8INPPS4            __at(0x7004);	// @ (0xE00 * 8 + 4)
#define                                 T8INPPS4_bit        _BIT_ACCESS(T8INPPS,4)
// T8INPPS<T8INPPS5>
extern volatile __bit                   T8INPPS5            __at(0x7005);	// @ (0xE00 * 8 + 5)
#define                                 T8INPPS5_bit        _BIT_ACCESS(T8INPPS,5)
// T8HLT<T8MODE0>
extern volatile __bit                   T8MODE0             __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 T8MODE0_bit         _BIT_ACCESS(T8HLT,0)
// T8HLT<T8MODE1>
extern volatile __bit                   T8MODE1             __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 T8MODE1_bit         _BIT_ACCESS(T8HLT,1)
// T8HLT<T8MODE2>
extern volatile __bit                   T8MODE2             __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 T8MODE2_bit         _BIT_ACCESS(T8HLT,2)
// T8HLT<T8MODE3>
extern volatile __bit                   T8MODE3             __at(0x795B);	// @ (0xF2B * 8 + 3)
#define                                 T8MODE3_bit         _BIT_ACCESS(T8HLT,3)
// T8HLT<T8MODE4>
extern volatile __bit                   T8MODE4             __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 T8MODE4_bit         _BIT_ACCESS(T8HLT,4)
// T8CON<T8ON>
extern volatile __bit                   T8ON                __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 T8ON_bit            _BIT_ACCESS(T8CON,7)
// T8CON<T8OUTPS0>
extern volatile __bit                   T8OUTPS0            __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 T8OUTPS0_bit        _BIT_ACCESS(T8CON,0)
// T8CON<T8OUTPS1>
extern volatile __bit                   T8OUTPS1            __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 T8OUTPS1_bit        _BIT_ACCESS(T8CON,1)
// T8CON<T8OUTPS2>
extern volatile __bit                   T8OUTPS2            __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 T8OUTPS2_bit        _BIT_ACCESS(T8CON,2)
// T8CON<T8OUTPS3>
extern volatile __bit                   T8OUTPS3            __at(0x7953);	// @ (0xF2A * 8 + 3)
#define                                 T8OUTPS3_bit        _BIT_ACCESS(T8CON,3)
// T8HLT<T8PSYNC>
extern volatile __bit                   T8PSYNC             __at(0x795F);	// @ (0xF2B * 8 + 7)
#define                                 T8PSYNC_bit         _BIT_ACCESS(T8HLT,7)
// T8RST<T8RSEL0>
extern volatile __bit                   T8RSEL0             __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 T8RSEL0_bit         _BIT_ACCESS(T8RST,0)
// T8RST<T8RSEL1>
extern volatile __bit                   T8RSEL1             __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 T8RSEL1_bit         _BIT_ACCESS(T8RST,1)
// T8RST<T8RSEL2>
extern volatile __bit                   T8RSEL2             __at(0x796A);	// @ (0xF2D * 8 + 2)
#define                                 T8RSEL2_bit         _BIT_ACCESS(T8RST,2)
// T8RST<T8RSEL3>
extern volatile __bit                   T8RSEL3             __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 T8RSEL3_bit         _BIT_ACCESS(T8RST,3)
// TMR0H<TMR0H0>
extern volatile __bit                   TMR0H0              __at(0x7EA0);	// @ (0xFD4 * 8 + 0)
#define                                 TMR0H0_bit          _BIT_ACCESS(TMR0H,0)
// TMR0H<TMR0H1>
extern volatile __bit                   TMR0H1              __at(0x7EA1);	// @ (0xFD4 * 8 + 1)
#define                                 TMR0H1_bit          _BIT_ACCESS(TMR0H,1)
// TMR0H<TMR0H2>
extern volatile __bit                   TMR0H2              __at(0x7EA2);	// @ (0xFD4 * 8 + 2)
#define                                 TMR0H2_bit          _BIT_ACCESS(TMR0H,2)
// TMR0H<TMR0H3>
extern volatile __bit                   TMR0H3              __at(0x7EA3);	// @ (0xFD4 * 8 + 3)
#define                                 TMR0H3_bit          _BIT_ACCESS(TMR0H,3)
// TMR0H<TMR0H4>
extern volatile __bit                   TMR0H4              __at(0x7EA4);	// @ (0xFD4 * 8 + 4)
#define                                 TMR0H4_bit          _BIT_ACCESS(TMR0H,4)
// TMR0H<TMR0H5>
extern volatile __bit                   TMR0H5              __at(0x7EA5);	// @ (0xFD4 * 8 + 5)
#define                                 TMR0H5_bit          _BIT_ACCESS(TMR0H,5)
// TMR0H<TMR0H6>
extern volatile __bit                   TMR0H6              __at(0x7EA6);	// @ (0xFD4 * 8 + 6)
#define                                 TMR0H6_bit          _BIT_ACCESS(TMR0H,6)
// TMR0H<TMR0H7>
extern volatile __bit                   TMR0H7              __at(0x7EA7);	// @ (0xFD4 * 8 + 7)
#define                                 TMR0H7_bit          _BIT_ACCESS(TMR0H,7)
// PIE0<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x714D);	// @ (0xE29 * 8 + 5)
#define                                 TMR0IE_bit          _BIT_ACCESS(PIE0,5)
// PIR0<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x719D);	// @ (0xE33 * 8 + 5)
#define                                 TMR0IF_bit          _BIT_ACCESS(PIR0,5)
// IPR0<TMR0IP>
extern volatile __bit                   TMR0IP              __at(0x70FD);	// @ (0xE1F * 8 + 5)
#define                                 TMR0IP_bit          _BIT_ACCESS(IPR0,5)
// TMR0L<TMR0L0>
extern volatile __bit                   TMR0L0              __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 TMR0L0_bit          _BIT_ACCESS(TMR0L,0)
// TMR0L<TMR0L1>
extern volatile __bit                   TMR0L1              __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 TMR0L1_bit          _BIT_ACCESS(TMR0L,1)
// TMR0L<TMR0L2>
extern volatile __bit                   TMR0L2              __at(0x7E9A);	// @ (0xFD3 * 8 + 2)
#define                                 TMR0L2_bit          _BIT_ACCESS(TMR0L,2)
// TMR0L<TMR0L3>
extern volatile __bit                   TMR0L3              __at(0x7E9B);	// @ (0xFD3 * 8 + 3)
#define                                 TMR0L3_bit          _BIT_ACCESS(TMR0L,3)
// TMR0L<TMR0L4>
extern volatile __bit                   TMR0L4              __at(0x7E9C);	// @ (0xFD3 * 8 + 4)
#define                                 TMR0L4_bit          _BIT_ACCESS(TMR0L,4)
// TMR0L<TMR0L5>
extern volatile __bit                   TMR0L5              __at(0x7E9D);	// @ (0xFD3 * 8 + 5)
#define                                 TMR0L5_bit          _BIT_ACCESS(TMR0L,5)
// TMR0L<TMR0L6>
extern volatile __bit                   TMR0L6              __at(0x7E9E);	// @ (0xFD3 * 8 + 6)
#define                                 TMR0L6_bit          _BIT_ACCESS(TMR0L,6)
// TMR0L<TMR0L7>
extern volatile __bit                   TMR0L7              __at(0x7E9F);	// @ (0xFD3 * 8 + 7)
#define                                 TMR0L7_bit          _BIT_ACCESS(TMR0L,7)
// PMD1<TMR0MD>
extern volatile __bit                   TMR0MD              __at(0x7268);	// @ (0xE4D * 8 + 0)
#define                                 TMR0MD_bit          _BIT_ACCESS(PMD1,0)
// TMR1L<TMR10>
extern volatile __bit                   TMR10               __at(0x7E68);	// @ (0xFCD * 8 + 0)
#define                                 TMR10_bit           _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR11>
extern volatile __bit                   TMR11               __at(0x7E69);	// @ (0xFCD * 8 + 1)
#define                                 TMR11_bit           _BIT_ACCESS(TMR1L,1)
// TMR1H<TMR110>
extern volatile __bit                   TMR110              __at(0x7E72);	// @ (0xFCE * 8 + 2)
#define                                 TMR110_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR111>
extern volatile __bit                   TMR111              __at(0x7E73);	// @ (0xFCE * 8 + 3)
#define                                 TMR111_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR112>
extern volatile __bit                   TMR112              __at(0x7E74);	// @ (0xFCE * 8 + 4)
#define                                 TMR112_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR113>
extern volatile __bit                   TMR113              __at(0x7E75);	// @ (0xFCE * 8 + 5)
#define                                 TMR113_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR114>
extern volatile __bit                   TMR114              __at(0x7E76);	// @ (0xFCE * 8 + 6)
#define                                 TMR114_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR115>
extern volatile __bit                   TMR115              __at(0x7E77);	// @ (0xFCE * 8 + 7)
#define                                 TMR115_bit          _BIT_ACCESS(TMR1H,7)
// TMR1L<TMR12>
extern volatile __bit                   TMR12               __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 TMR12_bit           _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR13>
extern volatile __bit                   TMR13               __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 TMR13_bit           _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR14>
extern volatile __bit                   TMR14               __at(0x7E6C);	// @ (0xFCD * 8 + 4)
#define                                 TMR14_bit           _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR15>
extern volatile __bit                   TMR15               __at(0x7E6D);	// @ (0xFCD * 8 + 5)
#define                                 TMR15_bit           _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR16>
extern volatile __bit                   TMR16               __at(0x7E6E);	// @ (0xFCD * 8 + 6)
#define                                 TMR16_bit           _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR17>
extern volatile __bit                   TMR17               __at(0x7E6F);	// @ (0xFCD * 8 + 7)
#define                                 TMR17_bit           _BIT_ACCESS(TMR1L,7)
// TMR1H<TMR18>
extern volatile __bit                   TMR18               __at(0x7E70);	// @ (0xFCE * 8 + 0)
#define                                 TMR18_bit           _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR19>
extern volatile __bit                   TMR19               __at(0x7E71);	// @ (0xFCE * 8 + 1)
#define                                 TMR19_bit           _BIT_ACCESS(TMR1H,1)
// PIE6<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x7178);	// @ (0xE2F * 8 + 0)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE6,0)
// PIR6<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x71C8);	// @ (0xE39 * 8 + 0)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR6,0)
// IPR6<TMR1GIP>
extern volatile __bit                   TMR1GIP             __at(0x7128);	// @ (0xE25 * 8 + 0)
#define                                 TMR1GIP_bit         _BIT_ACCESS(IPR6,0)
// TMR1H<TMR1H0>
extern volatile __bit                   TMR1H0              __at(0x7E70);	// @ (0xFCE * 8 + 0)
#define                                 TMR1H0_bit          _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR1H1>
extern volatile __bit                   TMR1H1              __at(0x7E71);	// @ (0xFCE * 8 + 1)
#define                                 TMR1H1_bit          _BIT_ACCESS(TMR1H,1)
// TMR1H<TMR1H2>
extern volatile __bit                   TMR1H2              __at(0x7E72);	// @ (0xFCE * 8 + 2)
#define                                 TMR1H2_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR1H3>
extern volatile __bit                   TMR1H3              __at(0x7E73);	// @ (0xFCE * 8 + 3)
#define                                 TMR1H3_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR1H4>
extern volatile __bit                   TMR1H4              __at(0x7E74);	// @ (0xFCE * 8 + 4)
#define                                 TMR1H4_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR1H5>
extern volatile __bit                   TMR1H5              __at(0x7E75);	// @ (0xFCE * 8 + 5)
#define                                 TMR1H5_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR1H6>
extern volatile __bit                   TMR1H6              __at(0x7E76);	// @ (0xFCE * 8 + 6)
#define                                 TMR1H6_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR1H7>
extern volatile __bit                   TMR1H7              __at(0x7E77);	// @ (0xFCE * 8 + 7)
#define                                 TMR1H7_bit          _BIT_ACCESS(TMR1H,7)
// PIE5<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x7170);	// @ (0xE2E * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE5,0)
// PIR5<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x71C0);	// @ (0xE38 * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR5,0)
// IPR5<TMR1IP>
extern volatile __bit                   TMR1IP              __at(0x7120);	// @ (0xE24 * 8 + 0)
#define                                 TMR1IP_bit          _BIT_ACCESS(IPR5,0)
// TMR1L<TMR1L0>
extern volatile __bit                   TMR1L0              __at(0x7E68);	// @ (0xFCD * 8 + 0)
#define                                 TMR1L0_bit          _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR1L1>
extern volatile __bit                   TMR1L1              __at(0x7E69);	// @ (0xFCD * 8 + 1)
#define                                 TMR1L1_bit          _BIT_ACCESS(TMR1L,1)
// TMR1L<TMR1L2>
extern volatile __bit                   TMR1L2              __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 TMR1L2_bit          _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR1L3>
extern volatile __bit                   TMR1L3              __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 TMR1L3_bit          _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR1L4>
extern volatile __bit                   TMR1L4              __at(0x7E6C);	// @ (0xFCD * 8 + 4)
#define                                 TMR1L4_bit          _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR1L5>
extern volatile __bit                   TMR1L5              __at(0x7E6D);	// @ (0xFCD * 8 + 5)
#define                                 TMR1L5_bit          _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR1L6>
extern volatile __bit                   TMR1L6              __at(0x7E6E);	// @ (0xFCD * 8 + 6)
#define                                 TMR1L6_bit          _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR1L7>
extern volatile __bit                   TMR1L7              __at(0x7E6F);	// @ (0xFCD * 8 + 7)
#define                                 TMR1L7_bit          _BIT_ACCESS(TMR1L,7)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x7269);	// @ (0xE4D * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x7E78);	// @ (0xFCF * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE5<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x7171);	// @ (0xE2E * 8 + 1)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE5,1)
// PIR5<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x71C1);	// @ (0xE38 * 8 + 1)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR5,1)
// IPR5<TMR2IP>
extern volatile __bit                   TMR2IP              __at(0x7121);	// @ (0xE24 * 8 + 1)
#define                                 TMR2IP_bit          _BIT_ACCESS(IPR5,1)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x726A);	// @ (0xE4D * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x7DEF);	// @ (0xFBD * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// TMR3L<TMR30>
extern volatile __bit                   TMR30               __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 TMR30_bit           _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR31>
extern volatile __bit                   TMR31               __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 TMR31_bit           _BIT_ACCESS(TMR3L,1)
// TMR3H<TMR310>
extern volatile __bit                   TMR310              __at(0x7E42);	// @ (0xFC8 * 8 + 2)
#define                                 TMR310_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR311>
extern volatile __bit                   TMR311              __at(0x7E43);	// @ (0xFC8 * 8 + 3)
#define                                 TMR311_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR312>
extern volatile __bit                   TMR312              __at(0x7E44);	// @ (0xFC8 * 8 + 4)
#define                                 TMR312_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR313>
extern volatile __bit                   TMR313              __at(0x7E45);	// @ (0xFC8 * 8 + 5)
#define                                 TMR313_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR314>
extern volatile __bit                   TMR314              __at(0x7E46);	// @ (0xFC8 * 8 + 6)
#define                                 TMR314_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR315>
extern volatile __bit                   TMR315              __at(0x7E47);	// @ (0xFC8 * 8 + 7)
#define                                 TMR315_bit          _BIT_ACCESS(TMR3H,7)
// TMR3L<TMR32>
extern volatile __bit                   TMR32               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 TMR32_bit           _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR33>
extern volatile __bit                   TMR33               __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 TMR33_bit           _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR34>
extern volatile __bit                   TMR34               __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 TMR34_bit           _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR35>
extern volatile __bit                   TMR35               __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 TMR35_bit           _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR36>
extern volatile __bit                   TMR36               __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 TMR36_bit           _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR37>
extern volatile __bit                   TMR37               __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 TMR37_bit           _BIT_ACCESS(TMR3L,7)
// TMR3H<TMR38>
extern volatile __bit                   TMR38               __at(0x7E40);	// @ (0xFC8 * 8 + 0)
#define                                 TMR38_bit           _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR39>
extern volatile __bit                   TMR39               __at(0x7E41);	// @ (0xFC8 * 8 + 1)
#define                                 TMR39_bit           _BIT_ACCESS(TMR3H,1)
// PIE6<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x7179);	// @ (0xE2F * 8 + 1)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE6,1)
// PIR6<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x71C9);	// @ (0xE39 * 8 + 1)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR6,1)
// IPR6<TMR3GIP>
extern volatile __bit                   TMR3GIP             __at(0x7129);	// @ (0xE25 * 8 + 1)
#define                                 TMR3GIP_bit         _BIT_ACCESS(IPR6,1)
// TMR3H<TMR3H0>
extern volatile __bit                   TMR3H0              __at(0x7E40);	// @ (0xFC8 * 8 + 0)
#define                                 TMR3H0_bit          _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR3H1>
extern volatile __bit                   TMR3H1              __at(0x7E41);	// @ (0xFC8 * 8 + 1)
#define                                 TMR3H1_bit          _BIT_ACCESS(TMR3H,1)
// TMR3H<TMR3H2>
extern volatile __bit                   TMR3H2              __at(0x7E42);	// @ (0xFC8 * 8 + 2)
#define                                 TMR3H2_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR3H3>
extern volatile __bit                   TMR3H3              __at(0x7E43);	// @ (0xFC8 * 8 + 3)
#define                                 TMR3H3_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR3H4>
extern volatile __bit                   TMR3H4              __at(0x7E44);	// @ (0xFC8 * 8 + 4)
#define                                 TMR3H4_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR3H5>
